import { Container, Link, Stack, Box } from "@chakra-ui/react";
import styled from "styled-components";

const Footer = () => {
  return (
    <FooterWrap>
      <Container>
        <FooterInner>
          <BoxStyle>
            <Link scr="/">
              <SvgLogo
                viewBox="0 0 138 20"
                focusable="false"
                class="chakra-icon css-1154hf1"
              >
                <path
                  d="M44.6507 9.00529H39.5137L40.9985 4.32904H36.4293L31.4803 19.9178H40.9914C43.1909 19.9178 45.1415 18.4678 45.8222 16.3267L47.067 12.4075C47.599 10.7284 46.3756 9.00529 44.6507 9.00529ZM42.5354 12.2829L41.5072 15.5238C41.1669 16.5943 40.1925 17.3184 39.0927 17.3184H36.8753L38.6897 11.6046H42.0535C42.3974 11.6046 42.641 11.9474 42.5354 12.2829Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M52.677 4.32904L51.6865 7.44715H56.2557L57.2463 4.32904H52.677Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M47.728 19.9178H52.2972L55.7614 9.00529H51.1921L47.728 19.9178Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M62.6144 11.6046H65.6898L66.5155 9.00712H63.4401L64.9232 4.32904H60.3539L56.485 16.5155C55.9512 18.1946 57.1746 19.9178 58.9013 19.9178H63.9757L64.7996 17.3203H61.4949C61.151 17.3203 60.9074 16.9775 61.0149 16.642L62.6144 11.6046Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M13.0509 9.76786L18.0483 4.32904H12.6927L8.56938 17.3203H5.14108C4.79718 17.3203 4.55179 16.9756 4.65926 16.6402L8.5658 4.32904H3.99653L0.125808 16.5192C-0.406169 18.1965 0.815409 19.9178 2.53851 19.9178H12.3129L15.777 9.00529L13.0509 9.76786Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M29.9578 4.32904H19.4597L21.0037 9.76786L18.7612 9.00529L15.297 19.9178H19.8663L21.516 14.7209H26.4596C28.6592 14.7209 30.608 13.2709 31.2886 11.1317L32.3687 7.72762C32.9025 6.05033 31.6809 4.32904 29.9578 4.32904ZM27.8388 7.6048L26.9737 10.3288C26.6334 11.3993 25.659 12.1234 24.5592 12.1234H22.3417L23.9914 6.92655H27.357C27.7009 6.92655 27.9445 7.27117 27.8388 7.6048Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M75.14 5.10811H78.3874L82.4194 15.181L84.841 5.10811H87.6979L84.1496 19.9178H80.9022L76.9079 9.62855L74.4469 19.9178H71.5899L75.14 5.10811Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M90.0605 5.10811H100.44L99.8331 7.72945H92.6595L91.7908 11.2802H98.2855L97.6783 13.797H91.1836L89.7184 19.9159H86.5122L90.0605 5.10811Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M105.658 7.72945H101.547L102.154 5.10811H113.561L112.953 7.72945H108.864L105.923 19.9178H102.717L105.658 7.72945Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M120.529 0.000170482C121.299 0.0184973 121.892 0.218259 122.31 0.599457C122.728 0.980654 122.915 1.49014 122.871 2.12791C122.82 2.90497 122.376 3.51892 121.541 3.96976C121.914 4.14569 122.184 4.3986 122.349 4.72849C122.517 5.0547 122.589 5.42124 122.563 5.82809C122.519 6.56483 122.255 7.15495 121.771 7.59846C121.291 8.03831 120.676 8.2509 119.924 8.23624C119.415 8.2289 118.929 8.09329 118.467 7.82938L117.967 10.4025H116.158L117.505 2.52377C117.608 1.76504 117.939 1.15293 118.5 0.687426C119.065 0.221925 119.741 -0.00716024 120.529 0.000170482ZM119.974 3.41995C120.582 3.40529 120.93 3.02959 121.018 2.29285C121.044 2.02162 121.002 1.81086 120.892 1.66058C120.782 1.50663 120.619 1.426 120.402 1.41866C120.131 1.41133 119.898 1.5048 119.704 1.69907C119.51 1.89333 119.383 2.1554 119.325 2.48528L118.61 6.59232C118.845 6.73894 119.153 6.81224 119.534 6.81224C119.856 6.81224 120.135 6.71694 120.369 6.52634C120.608 6.33208 120.747 6.0865 120.787 5.78961C120.813 5.632 120.817 5.48538 120.798 5.34976C120.74 4.93191 120.468 4.71199 119.985 4.69L119.561 4.6845L119.688 3.40896L119.974 3.41995Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M125.876 8.23074C125.344 8.22707 124.87 8.10245 124.452 7.85687C124.038 7.60763 123.724 7.26308 123.512 6.82324C123.299 6.37973 123.215 5.89224 123.259 5.36076L123.275 5.20682C123.374 4.22816 123.713 3.45477 124.292 2.88664C124.875 2.31485 125.588 2.03994 126.431 2.06194C126.941 2.06927 127.377 2.19939 127.74 2.4523C128.103 2.70154 128.368 3.04792 128.537 3.49143C128.706 3.93127 128.76 4.42609 128.702 4.9759L128.597 5.72913H125.057C125.064 6.04068 125.152 6.29359 125.321 6.48786C125.489 6.68212 125.735 6.78475 126.057 6.79575C126.581 6.81041 127.052 6.60882 127.47 6.19096L128.229 7.19711C128.005 7.51599 127.692 7.76707 127.289 7.95034C126.889 8.12994 126.451 8.22341 125.975 8.23074H125.876ZM126.316 3.48593C126.059 3.4786 125.836 3.55924 125.645 3.72784C125.458 3.89645 125.295 4.17868 125.156 4.57454H126.964L126.997 4.4151C127.019 4.28681 127.023 4.16585 127.008 4.05223C126.946 3.68569 126.715 3.49692 126.316 3.48593Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M132.201 0.692924L131.943 2.1719H132.894L132.669 3.45844H131.718L131.256 6.19096C131.23 6.3779 131.241 6.51901 131.289 6.61431C131.34 6.70961 131.465 6.76093 131.663 6.76826C131.74 6.77192 131.897 6.76276 132.135 6.74077L132.004 8.08229C131.699 8.18125 131.375 8.22707 131.03 8.21974C130.47 8.21241 130.05 8.04747 129.771 7.72492C129.493 7.40237 129.379 6.96436 129.43 6.41089L129.914 3.45844H129.178L129.397 2.1719H130.134L130.393 0.692924H132.201Z"
                  fill="currentColor"
                ></path>
                <path
                  d="M135.855 8.12078C135.804 7.97783 135.778 7.79822 135.778 7.58197C135.371 8.02914 134.886 8.2454 134.321 8.23074C133.804 8.22341 133.375 8.05113 133.035 7.71392C132.694 7.37671 132.534 6.96802 132.556 6.48786C132.575 5.84275 132.844 5.34793 133.364 5.00339C133.885 4.65518 134.596 4.48107 135.498 4.48107L136.102 4.49207L136.168 4.15669L136.19 3.86529C136.176 3.53175 136.009 3.35947 135.69 3.34848C135.294 3.34115 135.05 3.55924 134.959 4.00274L133.144 4.00824C133.163 3.60872 133.293 3.26234 133.535 2.96911C133.777 2.67222 134.105 2.44497 134.519 2.28736C134.937 2.12608 135.38 2.05094 135.85 2.06194C136.3 2.07293 136.694 2.16823 137.032 2.34783C137.372 2.52377 137.627 2.77118 137.796 3.09007C137.964 3.40529 138.029 3.76999 137.988 4.18418L137.543 6.98268L137.515 7.32356C137.501 7.5948 137.536 7.82572 137.62 8.01631L137.614 8.12078H135.855ZM134.821 6.9222C135.192 6.93686 135.516 6.77376 135.795 6.43288L135.976 5.47622L135.509 5.47072C135.219 5.47805 134.97 5.56419 134.761 5.72913C134.552 5.8904 134.429 6.11216 134.393 6.39439C134.374 6.54467 134.402 6.66929 134.475 6.76826C134.552 6.86356 134.667 6.91487 134.821 6.9222Z"
                  fill="currentColor"
                ></path>
              </SvgLogo>
            </Link>
            <div>
              <IconButton>
                <SvgIcon
                  viewBox="0 0 24 24"
                  focusable="false"
                  class="chakra-icon css-1gwhb0c"
                >
                  <path
                    d="M13.9191 10.7818L19.9408 4H17.1773L12.627 9.09971L8.7098 4H3L9.80714 12.7491L3.38719 20H6.14781L11.1028 14.4142L15.4489 20H21L13.9191 10.7818ZM6.23928 5.54012H7.8872L17.7447 18.3751H16.2126L6.23928 5.54012Z"
                    fill="currentColor"
                  ></path>
                </SvgIcon>
              </IconButton>
              <IconButton>
                <SvgIcon
                  viewBox="0 0 24 24"
                  focusable="false"
                  class="chakra-icon css-1gwhb0c"
                >
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M12 2C17.5229 2 22 6.47715 22 12C22 16.9912 18.3432 21.1283 13.5625 21.8785V14.8906H15.8926L16.3359 12H13.5625V10.1242C13.5625 10.0254 13.5686 9.92683 13.5816 9.83006C13.6727 9.15272 14.1053 8.5625 15.1922 8.5625H16.4531V6.10156C16.4531 6.10156 15.3088 5.90625 14.2146 5.90625C11.9305 5.90625 10.4375 7.29063 10.4375 9.79688V12H7.89844V14.8906H10.4375V21.8785C5.65684 21.1283 2 16.9912 2 12C2 6.47715 6.47715 2 12 2Z"
                    fill="currentColor"
                  ></path>
                </SvgIcon>
              </IconButton>
              <IconButton>
                <SvgIcon
                  viewBox="0 0 24 24"
                  focusable="false"
                  class="chakra-icon css-1gwhb0c"
                >
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M4 3C3.44772 3 3 3.44772 3 4V20C3 20.5523 3.44772 21 4 21H20C20.5523 21 21 20.5523 21 20V4C21 3.44772 20.5523 3 20 3H4ZM10.4584 8.02002L13.4246 12.2807V8.02002H16V15.981H13.5416L10.5754 11.7203V15.981H8V8.02002H10.4584Z"
                    fill="currentColor"
                  ></path>
                </SvgIcon>
              </IconButton>
              <IconButton>
                <SvgIcon
                  viewBox="0 0 24 24"
                  focusable="false"
                  class="chakra-icon css-1gwhb0c"
                >
                  <path
                    d="M13 21H9V9H13V11C13.8526 9.91525 15.1456 9.26857 16.525 9.237C19.0056 9.25077 21.0072 11.2694 21 13.75V21H17V14.25C16.84 13.1326 15.8818 12.3036 14.753 12.306C14.2593 12.3216 13.7932 12.5378 13.4624 12.9046C13.1316 13.2715 12.9646 13.7573 13 14.25V21ZM7 21H3V9H7V21ZM5 7C3.89543 7 3 6.10457 3 5C3 3.89543 3.89543 3 5 3C6.10457 3 7 3.89543 7 5C7 5.53043 6.78929 6.03914 6.41421 6.41421C6.03914 6.78929 5.53043 7 5 7Z"
                    fill="currentColor"
                  ></path>
                </SvgIcon>
              </IconButton>
              <IconButton>
                <SvgIcon
                  viewBox="0 0 24 24"
                  focusable="false"
                  class="chakra-icon css-1gwhb0c"
                >
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M12.013 19.5H11.992C11.927 19.5 5.4192 19.4872 3.7773 19.0322C2.87444 18.784 2.16935 18.0641 1.92663 17.1427C1.63138 15.4432 1.48881 13.7196 1.50068 11.9936C1.49305 10.2647 1.63949 8.53873 1.93817 6.83693C2.18756 5.91469 2.88956 5.1915 3.79094 4.9282C5.38772 4.5 11.7161 4.5 11.9847 4.5H12.0067C12.0728 4.5 18.5974 4.51285 20.2225 4.96781C21.1234 5.21725 21.8271 5.93566 22.071 6.85512C22.3757 8.56103 22.5187 10.2929 22.498 12.0268C22.5054 13.7535 22.3586 15.4774 22.0595 17.177C21.8137 18.0972 21.1081 18.8155 20.2057 19.0643C18.611 19.4957 12.2816 19.5 12.013 19.5ZM9.75 15.4571L9.75576 8.55001L15.75 12.0036L9.75 15.4571Z"
                    fill="currentColor"
                  ></path>
                </SvgIcon>
              </IconButton>
            </div>
          </BoxStyle>
          <LinkBox>
            <Link scr="/">공지사항</Link>
            <LinkBefore scr="/">자주하는 질문(FAQ)</LinkBefore>
            <LinkBefore scr="/">1:1문의하기</LinkBefore>
            <LinkBefore scr="/">카카오톡 상담(24시간)</LinkBefore>
            <LinkBefore scr="/">투자자보호센터</LinkBefore>
            <LinkBefore scr="/">개인정보처리방침</LinkBefore>
            <LinkBefore scr="/">청소년보호정책</LinkBefore>
            <LinkBefore scr="/">이용약관</LinkBefore>
          </LinkBox>

          <BoxText>
            <div>
              <p>고객센터 1588-5682 (운영시간 09:00 - 18:00)</p>
            </div>
            <div>
              <PtagBefore>
                보이스피싱 센터1533-1111 (운영시간 24시간)
              </PtagBefore>
            </div>
            <div>
              <PtagBefore>서울시 강남구 테헤란로4길 14, 2층</PtagBefore>
            </div>
          </BoxText>

          <BoxText>
            <div>
              <p>두나무(주)</p>
            </div>
            <div>
              <PtagBefore>대표 이석우</PtagBefore>
            </div>
            <div>
              <PtagBefore>사업자등록번호 119-86-54968</PtagBefore>
            </div>
            <div>
              <PtagBefore>가상자산사업자 등록번호 2021-01</PtagBefore>
            </div>
            <div>
              <PtagBefore>
                서울특별시 서초구 강남대로 369, 15층 기사 배열 책임자 박동규
              </PtagBefore>
            </div>
            <div>
              <PtagBefore>청소년 보호 책임자 김영빈</PtagBefore>
            </div>
          </BoxText>
          <BoxText>
            <p>
              NFT는 고위험 상품으로써 투자금의 전부 또는 일부 손실을 초래할 수
              있습니다. Upbit NFT 페이지 내 노출되는 모든 콘텐츠 정보는 NFT
              발행인이 제공하고 있으며, 투자 또는 거래의 권유를 목적으로 하지
              않습니다. <br /> 해당 정보는 서비스 이용을 위한 보조 자료로 참고해
              주시기 바랍니다. 두나무(주)는 NFT 거래 중개자이며, NFT 거래
              당사자가 아닙니다. NFT 거래에 관한 일체의 책임은 판매자가
              부담합니다.
            </p>
          </BoxText>

          <BoxText>
            <p>Copyright ⓒ 2017-2023 Dunamu Inc. All rights reserved.</p>
          </BoxText>
        </FooterInner>
      </Container>
    </FooterWrap>
  );
};

export default Footer;

const FooterWrap = styled.footer`
  width: 100%;
  margin-top: 88px;
  background: #101010;
  padding-top: 32px;
  padding-bottom: 32px;
  color: #fff;
`;

const FooterInner = styled(Stack)`
  display: block;
`;
const BoxStyle = styled(Box)`
  display: flex;
  justify-content: space-between;
`;
const BoxText = styled(Box)`
  opacity: 0.7;
  display: flex;
  font-size: 12px;
`;
const LinkBox = styled(Box)`
  font-size: 14px;
`;
const LinkBefore = styled(Link)`
  position: relative;
  margin-left: 20px;
  &::before {
    content: "";
    width: 1px;
    height: 14px;
    background: #fff;
    position: absolute;
    left: -10px;
    margin-top: 6px;
  }
`;
const PtagBefore = styled.p`
  position: relative;
  margin-left: 10px;
  &::before {
    content: "";
    width: 1px;
    height: 14px;
    background: #ccc;
    position: absolute;
    left: -5px;
    margin-top: 3px;
  }
`;
const IconButton = styled.button`
  display: inline-flex;
  -webkit-box-align: center;
  align-items: center;
  -webkit-box-pack: center;
  justify-content: center;
  width: 32px;
  height: 32px;
`;
const SvgIcon = styled.svg`
  width: 18px;
  height: 18px;
  display: inline-block;
  line-height: 1em;
  flex-shrink: 0;
  color: #fff;
  vertical-align: middle;
  fill: none;
`;
const SvgLogo = styled.svg`
  width: 138px;
  height: 20px;
  display: inline-block;
  line-height: 1em;
  flex-shrink: 0;
  color: var(--chakra-colors-content-white);
  vertical-align: middle;
  fill: none;
`;
